---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments
source: html/5aefe2c1-4d0b-05e7-7f71-ab74989eeb94.htm
---
# RebarShapeDefinitionBySegments Methods

Specify a default-radius bend.